MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F128C.atdf
         <register caption="DMA Channel x Source Size Register" name="DCH3SSIZ" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH3SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH0DSIZ" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH0DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH1DSIZ" offset="0x180" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH1DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH2DSIZ" offset="0x240" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH2DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH3DSIZ" offset="0x300" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH3DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH0SPTR" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH0SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH1SPTR" offset="0x190" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH1SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH2SPTR" offset="0x250" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH2SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH3SPTR" offset="0x310" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH3SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH0DPTR" offset="0xe0" rw="R" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH0DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH1DPTR" offset="0x1a0" rw="R" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH1DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH2DPTR" offset="0x260" rw="R" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH2DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH3DPTR" offset="0x320" rw="R" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH3DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH0CSIZ" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH0CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH1CSIZ" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH1CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH2CSIZ" offset="0x270" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH2CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH3CSIZ" offset="0x330" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH3CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH0CPTR" offset="0x100" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH0CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH1CPTR" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH1CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH2CPTR" offset="0x280" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH2CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH3CPTR" offset="0x340" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH3CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH0DAT" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="DCHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH1DAT" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="DCHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH2DAT" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="DCHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH3DAT" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="DCHPDAT" />
         </register>
      </register-group>
