MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F128C.atdf
      <value-group caption="Busy bit (Master mode only)" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Address bits" name="PMADDR__ADDR">
         <value caption="address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x1" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="PMCS1 Address Port Enable bits" name="PMAEN__PTEN14">
         <value caption="PMA14 functions as either PMA(14) or PMCS1" name="" value="0x4000" />
         <value caption="PMA14 functions as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Address Port Enable bits" name="PMAEN__PTEN10">
         <value caption="PMA(10:2) function as PMP address lines" name="" value="0x7fc" />
         <value caption="PMA(10) functions as PMP address line, PMA(9:2) function as port I/O" name="" value="0x400" />
         <value caption="PMA(9) functions as PMP address line, PMA(10) and PMA(8:2) function as port I/O" name="" value="0x200" />
         <value caption="PMA(10:2) function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Address Port Enable bits" name="PMAEN__PTEN1">
         <value caption="PMA1 and PMA0 function as either PMA(1:0) or PMALH and PMALL" name="" value="0x3" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="PORT" version="">
      <register-group name="PORT">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELA" />
            <bitfield mask="0x00000002" name="ANSELA" />
            <bitfield mask="0x00000004" name="ANSELA" />
            <bitfield mask="0x00000008" name="ANSELA" />
            <bitfield mask="0x00000010" name="ANSELA" />
            <bitfield mask="0x00000020" name="ANSELA" />
            <bitfield mask="0x00000040" name="ANSELA" />
            <bitfield mask="0x00000080" name="ANSELA" />
            <bitfield mask="0x00000100" name="ANSELA" />
            <bitfield mask="0x00000200" name="ANSELA" />
            <bitfield mask="0x00000400" name="ANSELA" />
            <bitfield mask="0x00000800" name="ANSELA" />
            <bitfield mask="0x00001000" name="ANSELA" />
            <bitfield mask="0x00002000" name="ANSELA" />
            <bitfield mask="0x00004000" name="ANSELA" />
            <bitfield mask="0x00008000" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELB" />
            <bitfield mask="0x00000002" name="ANSELB" />
            <bitfield mask="0x00000004" name="ANSELB" />
            <bitfield mask="0x00000008" name="ANSELB" />
            <bitfield mask="0x00000010" name="ANSELB" />
            <bitfield mask="0x00000020" name="ANSELB" />
            <bitfield mask="0x00000040" name="ANSELB" />
            <bitfield mask="0x00000080" name="ANSELB" />
            <bitfield mask="0x00000100" name="ANSELB" />
            <bitfield mask="0x00000200" name="ANSELB" />
            <bitfield mask="0x00000400" name="ANSELB" />
            <bitfield mask="0x00000800" name="ANSELB" />
            <bitfield mask="0x00001000" name="ANSELB" />
            <bitfield mask="0x00002000" name="ANSELB" />
            <bitfield mask="0x00004000" name="ANSELB" />
            <bitfield mask="0x00008000" name="ANSELB" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELC" />
            <bitfield mask="0x00000002" name="ANSELC" />
            <bitfield mask="0x00000004" name="ANSELC" />
            <bitfield mask="0x00000008" name="ANSELC" />
            <bitfield mask="0x00000010" name="ANSELC" />
            <bitfield mask="0x00000020" name="ANSELC" />
            <bitfield mask="0x00000040" name="ANSELC" />
            <bitfield mask="0x00000080" name="ANSELC" />
            <bitfield mask="0x00000100" name="ANSELC" />
            <bitfield mask="0x00000200" name="ANSELC" />
            <bitfield mask="0x00000400" name="ANSELC" />
            <bitfield mask="0x00000800" name="ANSELC" />
            <bitfield mask="0x00001000" name="ANSELC" />
            <bitfield mask="0x00002000" name="ANSELC" />
            <bitfield mask="0x00004000" name="ANSELC" />
            <bitfield mask="0x00008000" name="ANSELC" />
         </register>
